'use strict';

// Завдання 1:

// Дано масив чисел [1, 2, 3, 4, 5]. Створіть новий масив, що містить 
// квадрати кожного елементу вхідного масиву. 
// Очікуваний результат: [1, 4, 9, 16, 25].

// const numbers = [[1, 2, 3, 4, 5]]

const numbers = [1, 2, 3, 4, 5];
const squaredNumbers = numbers.map(num => num * num);

console.log(squaredNumbers); // Очікуваний результат: [1, 4, 9, 16, 25]

// Пояснення:
// map() — це метод масиву, який застосовує функцію до кожного елементу масиву 
// і повертає новий масив з результатами.

// У цьому випадку, функція num => num * num приймає кожен елемент масиву
//  (num) і повертає його квадрат.

// Таким чином, squaredNumbers буде новим масивом, що містить квадрати
//  кожного елементу з початкового масиву numbers.